content/posts/20231128-1043.org
#+title: Orgの項目を自分宛てにメールする
#+date: <2023-11-28 10:43>
#+description:
#+filetags: org japanese mail

#+SETUPFILE: content/header

{{{preview-begin}}}
「２要素認証で必要だから」。残念な話だが、私がスマホをもつ最大の理由がコレだ。世の中にはモバイル機器だけでいろいろなことをやろうと腐心する方々がいるが、その流れには個人的に乗れずにいる。それでも[[https://lwn.net/Articles/936576/][EmacsのAndroid対応]]が議論を呼んだり、[[https://organice.200ok.ch/][こちら]]や[[https://orgzly.com/][あちら]]のようにOrgをモバイルで使える手段が増えることにはポジティブな印象をもっている。ただ私はと言うと、PCでつくったOrgの内容をメールとしてモバイル端末で見られれば充分だ。
{{{preview-end}}}

#+begin_src emacs-lisp
  (require 'smtpmail)
  (require 'message)

  (setq smtpmail-default-smtp-server "<<smtp-host>>"
        smtpmail-smtp-service 465
        smtpmail-smtp-user user-mail-address
        smtpmail-stream-type 'ssl
        smtpmail-mail-address user-mail-address)
  (setq message-send-mail-function 'smtpmail-send-it)

  (defun my/org-subtree-send-email ()
    "Send an email containing the contents of the subtree at the entry at point."
    (interactive)
    (org-save-outline-visibility t
      (save-excursion
        (org-fold-show-all)
        (let* ((heading (org-get-heading t t t t))
               (org-export-with-toc nil)
               (org-export-with-author nil)
               (org-export-show-temporary-export-buffer nil)
               (message-kill-buffer-on-exit t)
               (exp-buf (org-ascii-export-as-ascii nil t t t)))
          (message-mail user-mail-address heading)
          (message-goto-body)
          (insert (with-current-buffer exp-buf (buffer-string)))
          (message-send-and-exit)))))
#+end_src

もっともよく活用する用途と言えばToDoリストだろう。買い物リストはその代表例だ。予めOrgの中に店舗ごとのトリガリストをつくっておき、買い物に行く段になったらリストから今回の買うべきターゲットを浮かび上がらせてコマンド一発でメール送信。トクバイを知らせるアプリに踊らされることもないし、なんちゃらペイをフル活用してお得にポイントを貯めることもない。

あとは考えたいことリストだろうか。散歩中に時間ができたときなど、脳にまかせて気ままに思考を走らせると脱線がすぎるので、その交通整理役としてリストをつくっておきメール送信することがたまにはある。いずれにしても、PC上で作戦を練り出先でそれを実行するというスキームにおいて、私はスマホの第二の活用法を見出しているようだ。そのスキームを支えるのには、メールという古典的でオープンな仕組みが望ましい。
