blog/20231128-1043.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/blog/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/blog">
<title>Orgの項目を自分宛てにメールする</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org">Home</a><a href="https://www.p-snow.org/config/dotfiles.html#gnu-emacs">Emacs Config</a><a href="https://www.p-snow.org/tag-english.html">Posts</a><a href="https://www.p-snow.org/tag-japanese.html">日本語記事</a><a href="https://www.p-snow.org/about.html">About</a><a href="https://www.p-snow.org/rss.xml">RSS</a></nav><h1>.dot life</h1><p>by p-snow</p></header></div>
<div id="content">
<div class="post-date">28 Nov 2023</div><h1 class="post-title"><a href="https://www.p-snow.org/config/blog/20231128-1043.html">Orgの項目を自分宛てにメールする</a></h1>
<p>
<preview>
「２要素認証で必要だから」。残念な話だが、私がスマホをもつ最大の理由がコレだ。世の中にはモバイル機器だけでいろいろなことをやろうと腐心する方々がいるが、その流れには個人的に乗れずにいる。それでも<a href="https://lwn.net/Articles/936576/">EmacsのAndroid対応</a>が議論を呼んだり、<a href="https://organice.200ok.ch/">こちら</a>や<a href="https://orgzly.com/">あちら</a>のようにOrgをモバイルで使える手段が増えることにはポジティブな印象をもっている。ただ私はと言うと、PCでつくったOrgの内容をメールとしてモバイル端末で見られれば充分だ。
</preview>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">smtpmail</span>)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">message</span>)

(<span style="font-weight: bold;">setq</span> smtpmail-default-smtp-server <span style="font-style: italic;">"&lt;&lt;smtp-host&gt;&gt;"</span>
      smtpmail-smtp-service 465
      smtpmail-smtp-user user-mail-address
      smtpmail-stream-type 'ssl
      smtpmail-mail-address user-mail-address)
(<span style="font-weight: bold;">setq</span> message-send-mail-function 'smtpmail-send-it)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-subtree-send-email</span> ()
  <span style="font-style: italic;">"Send an email containing the contents of the subtree at the entry at point."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">org-save-outline-visibility</span> t
    (<span style="font-weight: bold;">save-excursion</span>
      (org-fold-show-all)
      (<span style="font-weight: bold;">let*</span> ((heading (org-get-heading t t t t))
             (org-export-with-toc nil)
             (org-export-with-author nil)
             (org-export-show-temporary-export-buffer nil)
             (message-kill-buffer-on-exit t)
             (exp-buf (org-ascii-export-as-ascii nil t t t)))
        (message-mail user-mail-address heading)
        (message-goto-body)
        (insert (<span style="font-weight: bold;">with-current-buffer</span> exp-buf (buffer-string)))
        (message-send-and-exit)))))
</pre>
</div>

<p>
もっともよく活用する用途と言えばToDoリストだろう。買い物リストはその代表例だ。予めOrgの中に店舗ごとのトリガリストをつくっておき、買い物に行く段になったらリストから今回の買うべきターゲットを浮かび上がらせてコマンド一発でメール送信。トクバイを知らせるアプリに踊らされることもないし、なんちゃらペイをフル活用してお得にポイントを貯めることもない。
</p>

<p>
あとは考えたいことリストだろうか。散歩中に時間ができたときなど、脳にまかせて気ままに思考を走らせると脱線がすぎるので、その交通整理役としてリストをつくっておきメール送信することがたまにはある。いずれにしても、PC上で作戦を練り出先でそれを実行するというスキームにおいて、私はスマホの第二の活用法を見出しているようだ。そのスキームを支えるのには、メールという古典的でオープンな仕組みが望ましい。
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/blog/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/blog/tag-org.html">org</a> <a href="https://www.p-snow.org/config/blog/tag-japanese.html">japanese</a> <a href="https://www.p-snow.org/config/blog/tag-mail.html">mail</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
